modules/teacher/views/group-test/view.php

SELECT * FROM `group` WHERE `id`=17
---
</p>
    <div class="row d-flex justify-content-between">
        <div class="col-6">
            <h2>Группа: <?= Html::encode($model->group->title) ?> </h2>

SELECT * FROM `test` WHERE `id`=180
---
    </div>


    <?= DetailView::widget([
        'model' => $model,
        'attributes' => [
            [
                'format' => 'raw',
                'attribute' => 'date',
                'value' => function($model) use ($date_str){
                    return $date_str;
                },

                'label' => 'Даты проведения теста'
            ],
            [
                'attribute' => 'avg_points',
                'value' => function($model){
                    if($model -> avg_points !== null){
                        $max_points = Test::findOne($model->test_id)->max_points;
                        return round($model -> avg_points, 2) . ' / ' . $max_points ;
                    }else{
                        return '';
                    }