modules/student/views/group-test/index.php

SELECT * FROM `test` WHERE `id`=149
---
        <?= Html::a('Create Group Test', ['create'], ['class' => 'btn btn-success']) ?>
    </p> -->

    <!-- <?php echo $this->render('_search', ['model' => $searchModel]); ?> -->
    <!-- <?VarDumper::dump(Yii::$app->session->get('questions_square'));?> -->
    <?= ListView::widget([
        'dataProvider' => $dataProvider,
        'itemOptions' => ['class' => 'item'],
        'itemView' => function ($model, $key, $index, $widget) {
            return Html::a(Html::encode($model->test->title), ['/student/test'], [  'class'=>'test-n',
            'data' => [
                'method' => 'post',
                'params' => [
                    'question' => 0,
                    'id'=> $model->id,
                ],
            ]
        ]);
        },
    ]) ?>