modules/student/controllers/DefaultController.php

SELECT * FROM `user_group` WHERE `user_id`=81
SELECT * FROM `group` WHERE `id`=1
SELECT * FROM `group_test` WHERE `id`=1
SELECT * FROM `test` WHERE `id`=24
SELECT * FROM `student_test` WHERE `id`=40
---
    public function actionIndex()
    {
        $group_id = Group::getCurrentGroup(UserGroup::findOne(['user_id' => Yii::$app->user->identity->id]));
        $group = Group::findOne($group_id)->title;
        $tests_count = StudentTest::getTestsCount(Yii::$app->user->identity->id);

        $tests = StudentTest::getPassedTests(Yii::$app->user->identity->id);
        $test_list = [];
        foreach($tests as $group_test_id => $student_test_id){
            $test_title = Test::findOne(GroupTest::findOne($group_test_id)->test_id)->title;
            $test_mark = StudentTest::findOne($student_test_id)->mark;
            if(StudentTest::findOne($student_test_id)->cheked){