modules/student/controllers/TestController.php

    public function actionIndex()
    {

        $group_test_id = Yii::$app->request->post('id');
        $session = Yii::$app->session;
        $current_question = Yii::$app->request->post('question');
        $current_question = empty($current_question) ? 1 : $current_question;

        $attempt = StudentAnswer::getLastAttempt($group_test_id) + 1;

        $modelStudentAnswer = new StudentAnswer();

        if ($this->request->isPost) {
            if(isset($_POST['StudentAnswer'])){
                if(is_array($_POST['StudentAnswer']['answer_id'])){
                    foreach($_POST['StudentAnswer']['answer_id'] as $answer_id){
                        $modelStudentAnswer = new StudentAnswer();
                        $modelStudentAnswer->user_id = Yii::$app->user->identity->id;
                        $modelStudentAnswer->question_id = $_POST['StudentAnswer']['question_id'];
                        $modelStudentAnswer->answer_id = $answer_id;
                        $modelStudentAnswer -> attempt = $attempt;
                        $modelStudentAnswer->save();
                    }
                }else{
                    $modelStudentAnswer = new StudentAnswer();
                    $modelStudentAnswer->user_id = Yii::$app->user->identity->id;
                    $modelStudentAnswer->question_id = $_POST['StudentAnswer']['question_id'];
                    $modelStudentAnswer->load($this->request->post());
                    $modelStudentAnswer->save();
---
INSERT INTO `student_answer` (`user_id`, `question_id`, `attempt`, `cheked`, `answer_id`, `answer_title`) VALUES (81, 335, 3, 0, 673, 'asd')

        }
        $session->set('passed_questions', $passed_questions);

        $test_id = GroupTest::findOne([$group_test_id])->test_id;
---
SELECT * FROM `group_test` WHERE `id`='35'


        }

        $question = Question::findOne($question_id);
        $answers = Answer::find()
        ->select('title')
        ->where(['question_id' => $question->id])
        ->indexBy('id')
        ->column();
---
SELECT * FROM `question` WHERE `id`=332
SELECT `title`, `answer`.`id` FROM `answer` WHERE `question_id`=332


        $questions_str = join(array_map(fn($question_key, $question) => "<div class='btn  btn-my-green-outline {$question} question-square text-center'>{$question_key}</div>", array_keys($questions_square), $questions_square));

        $test_title = Test::findOne($test_id)->title;
---
SELECT * FROM `test` WHERE `id`=178