modules/teacher/views/student-test/view.php

                'attribute' => 'points',
                'label' => 'Баллы за последнюю попытку',
                'value' => function($modelStudentTest){
                    return $modelStudentTest->points . ' / ' . Test::findOne($modelStudentTest->test_id)->max_points;
---
SELECT * FROM `test` WHERE `id`=178

                        $group_title = UserGroup::getGroupTitleByUser($modelStudentTest->user_id);
                        $group_id = Group::getGroupId($group_title);
                        $current_group = Group::getCurrentGroup($group_id);
                        $group_title = Group::findOne($current_group) -> title;
---
SELECT * FROM `group` WHERE `id`=1