modules/teacher/views/group/index.php

SELECT * FROM `group` WHERE `id`=1
SELECT * FROM `group` WHERE `id`=10
---
                  }
            }
        }else{
            if( Group::findOne($key)->year + 1 == date('Y') ){

                if(Group::findOne($key)->course == 4 ){
                    $fourth_course[$key] = $val;

                  }elseif(Group::findOne($key)->course == 3 ){
                      $third_course[$key] = $val;

                  }elseif(Group::findOne($key)->course == 2 ){