modules/teacher/views/group/view.php

SELECT * FROM `user` WHERE `id`=81
SELECT * FROM `user` WHERE `id`=110
---

   $list_of_students = ['<ol class="">'];
    foreach($students as $key => $student){
        if(User::findOne($key)->graduated !== null){
            $date = new DateTimeImmutable(User::findOne($key)->graduated );