modules/teacher/views/deny/index.php

SELECT * FROM `group_test` WHERE `id`='36'
---
?>
<div class="deny-index info-block">

    <h1>Ограничение доступа для группы <?=Group::getGroupTitle(GroupTest::findOne($group_test_id)->group_id)?></h1>