modules/teacher/views/student/view.php

SELECT * FROM `group` WHERE `id`=1
---
                    $group_title = UserGroup::getGroupTitleByUser($modelUser->id);
                    $group_id = Group::getGroupId($group_title);
                    $current_group = Group::getCurrentGroup($group_id);
                    $group_title = Group::findOne($current_group) -> title;