modules/teacher/controllers/DefaultController.php

    public function actionIndex()
    {
        $all_tests = ["<table class='table table-hover'>" .
            "<thead >
                <tr class='table-success'>
                    <th scope='col'>Тест</th>
                    <th scope='col'>Группа</th>
                    <th scope='col'>Дата</th>
                    <th scope='col'>Средний бал</th>
                </tr>
            </thead>
            <tbody>"
        ];
        foreach(UserGroup::getTeachersGroups(\Yii::$app->user->identity->id) as $group){
            foreach(GroupTest::getTestStatistic($group['group_id']) as $group_test) {
                $test_title = Test::findOne($group_test['test_id'])->title;
                $test_date = GroupTest::getTestDates($group_test['id']);
                $test_group = Group::findOne($group_test['group_id'])->title;
                if($group_test['avg_points']){
                    $test_avg = round($group_test['avg_points'], 2);
                }
                $test_max = Test::findOne($group_test['test_id'])->max_points;
---
SELECT * FROM `test` WHERE `id`=24
SELECT * FROM `group` WHERE `id`=1

        foreach (StudentTest::getUncheckedTests() as $test) {
            $student_id = $test['user_id'];
            $id = $test['id'];
            $test_title = Test::findOne($test['test_id'])->title;
---
SELECT * FROM `test` WHERE `id`=24