modules/teacher/controllers/GroupTestController.php

    public function actionView($id)
    {
        $model = $this->findModel($id);
        $list = [];
        $model_student_test = [];
        foreach($model->studentTests as $student_test_item){
            $test = StudentTest::find()
                        ->where(['user_id' => $student_test_item->user_id, 'group_test_id' => $id])
                        ->orderBy(['attempt' => SORT_DESC])
                        ->limit(1)
                        ->asArray()
                        ->all();
---
SELECT * FROM `student_test` WHERE (`user_id`=111) AND (`group_test_id`='36') ORDER BY `attempt` DESC LIMIT 1

        array_push($list, "<h3 id='not-passed' class='mt-5  border-bottom'>Студенты не проходившие тест</h3>");
        $students_unpass = (GroupTest::getTestUnpass($model->group_id, $model->id));
        foreach ( $students_unpass as $student){
            $user = User::findOne($student);
---
SELECT * FROM `user` WHERE `id`=123

    protected function findModel($id)
    {
        if (($model = GroupTest::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `group_test` WHERE `id`='36'