modules/teacher/controllers/GroupController.php

SELECT `title`, `group`.`id` FROM `group`
---
    public function actionIndex()
    {
        $searchModel = new GroupSerch();
        $groups = Group::find()->select(['title'])->indexBy('id')->column();

SELECT * FROM `group` WHERE `id`='1'
SELECT * FROM `group` WHERE `previous_group_id`='1'
SELECT * FROM `user` WHERE `id`=111
---
    public function actionView($id)
    {
        $modelGroup = Group::findOne($id);
        $next_group = Group::findOne(['previous_group_id' => $id]);
        $searchModel = new GroupTestSearch();
        $dataProvider = $searchModel->search($this->request->queryParams);
        $dataProvider->query->andWhere([ 'group_id' => $id]);
        $first_previous_group = Group::getPreviousGroups($id);

        $marks = Group::getMarks($id);
        $marks_percent = Group::getMarksPercent($id);
        $tests_count = Group::getTestsCount($id);
        $students = UserGroup::getUsersOfGroup(Group::getPreviousGroups($id), $id);
        if(Yii::$app->request->isPost){
            $btn = Yii::$app->request->get('btn');
            if($btn === 'document'){
                $phpWord = new \PhpOffice\PhpWord\PhpWord();
                $section = $phpWord->addSection();
                $title = $modelGroup->title;
                $phpWord->addTitleStyle(1, array('size' => 16, 'bold' => true));
                $section->addTitle('Группа: ' . $title, 1);
                $counter = 1;
                foreach($students as $id => $fio){
                    $login = User::findOne($id)->login;
                    $password = User::findOne($id)->password_2;