modules/teacher/controllers/StudentController.php

SELECT * FROM `user` WHERE `id`='81'
SELECT `group_test_id` FROM `student_test` WHERE `user_id`=81 ORDER BY `id` DESC
SELECT * FROM `student_test` WHERE (`user_id`=81) AND (`group_test_id`=35 OR `group_test_id` IS NULL) ORDER BY `id` DESC LIMIT 1
---
    public function actionView($id)
    {
        $modelUser = User::findOne($id);
        $searchModel = new StudentTestSearch();
        $dataProvider = $searchModel->search($this->request->queryParams);
        $dataProvider->query->andWhere([ 'user_id' => $id]);

        $student_group_test_id = StudentTest::find()
                            ->select('group_test_id')
                            ->where(['user_id' => $modelUser->id])
                            ->orderBy(['id' => SORT_DESC])
                            ->all();
        $ids = [];
        $list = [];

        foreach($student_group_test_id as $id){
            if(!in_array($id, $ids)){
                array_push($ids, $id);
                $student_test = StudentTest::find()
                            ->where(['user_id' => $modelUser->id, 'group_test_id' => $id])
                            ->orderBy(['id' => SORT_DESC])
                            ->limit(1)
                            ->one();

SELECT * FROM `test` WHERE `id`=178
---
                    $span = '';
                }
                array_push($list,
                    Html::a(Test::findOne($student_test->test_id)->title,
                        '/teacher/student-test/view?id=' . $student_test->id. '&student_id=' . $student_test->user_id,
                        ['class' => $class]) . $span. '<br>');