modules/teacher/controllers/StudentTestController.php

    public function actionView($id)
    {


        $user_id = Yii::$app->request->get('student_id');
        $modelStudentTest = StudentTest::findOne($id);
        $group_test_id = $modelStudentTest->group_test_id;

        $modelTest = Test::findOne(['id' => $modelStudentTest->test_id]);
---
SELECT * FROM `student_test` WHERE `id`='66'
SELECT * FROM `test` WHERE `id`=178


        $questions = [];

        $student_tests = StudentTest::find()
                        ->where(['user_id' => $user_id, 'group_test_id' => $group_test_id])
                        ->orderBy(['attempt' => SORT_DESC])
                        ->all();
---
SELECT * FROM `student_test` WHERE (`user_id`='81') AND (`group_test_id`=35) ORDER BY `attempt` DESC

                    ."<p class='text-muted col-6 text-end mb-0'>". $date->format('d/m/Y') ."</p>"
                ."</div>"
            );
            $student_answers_all = StudentAnswer::find()
                                ->where(['user_id' => $user_id, 'attempt' => $student_test->attempt])
                                ->all();
---
SELECT * FROM `student_answer` WHERE (`user_id`='81') AND (`attempt`=3)

            }
            $question_ids = array_unique($question_ids);
            foreach($question_ids as $id){
                $question = Question::findOne($id);
---
SELECT * FROM `question` WHERE `id`=328

                    "</li>"
                );
                foreach($question->answers as $answer){
                    $answer_student = StudentAnswer::findOne(['answer_id' => $answer->id, 'user_id' => $user_id, 'attempt' => $student_test->attempt]);
---
SELECT * FROM `student_answer` WHERE (`answer_id`=654) AND (`user_id`='81') AND (`attempt`=3)