models/Deny.php

    public static function accessForAll($group_test_id)
    {
        $all_denies = static::find()->where(['group_test_id' =>  $group_test_id])->asArray()->all();

        foreach( $all_denies as $deny){
            $deny_item = Deny::findOne([$deny['id']]);
            $deny_item->true_false = 1;
            $deny_item->save();
---
SELECT * FROM `deny` WHERE `group_test_id`='36'
SELECT * FROM `deny` WHERE `id`=29
UPDATE `deny` SET `true_false`=1 WHERE `id`=29