models/Group.php

SELECT * FROM `group` WHERE `id`=11
---
    public static function getGroupTitle($id)
    {
        return static::findOne(['id' => $id])->title;

SELECT * FROM `group` WHERE `title`='196'
---
    public static function getGroupId($title)
    {
        return static::findOne(['title' => $title])->id;

SELECT * FROM `group` WHERE `id`='1'
SELECT * FROM `group` WHERE `id` IS NULL
---
    public static function getPreviousGroups($id)
    {
        $previous_groups = [];
        $current_group = static::findOne($id);
        $q = $current_group -> id;
        for($i = 4; $i > 0; $i--){
            if( $prev_id = static::findOne($q)){

SELECT * FROM `group` WHERE `previous_group_id` IN (59, 11, 81)
SELECT * FROM `group` WHERE `previous_group_id`=9
---
    public static function getCurrentGroup($first_group_id)
    {
        $next_groups = [];
        $next_group = Group::findOne(['previous_group_id' => $first_group_id]);
        if($next_group){
            $next_group_id = $next_group -> id;
            for($i = 1; $i < 5; $i++){
                if($next_group = Group::findOne(['previous_group_id' => $next_group_id])){

SELECT * FROM `group_test` WHERE `group_id`='1'
SELECT * FROM `student_test` WHERE (`group_test_id`=1) AND (`user_id`=81) ORDER BY `id` DESC LIMIT 1
---
    public static function getMarks($group_id)
    {
        $group_test = GroupTest::find()
                                ->where(['group_id' => $group_id])
                                ->all();
        $student_tests = [];
        $students = UserGroup::getCurrentStudents(Group::getPreviousGroups($group_id));
        foreach($group_test as $test){
            foreach($students as $id => $fio){
                $student_test = StudentTest::find()
                                ->where(['group_test_id' => $test ->id, 'user_id' => $id])
                                ->orderBy(['id' => SORT_DESC])
                                ->limit(1)
                                ->one();

SELECT * FROM `group_test` WHERE `group_id`='1'
---
    public static function getMarksPercent($group_id)
    {
        $group_test = GroupTest::find()->where(['group_id' => $group_id])->all();

SELECT COUNT(*) FROM `group_test` WHERE `group_id`='1'
---
    public static function getTestsCount($group_id)
    {
        return GroupTest::find()->where(['group_id' => $group_id])->count();