models/GroupTest.php

    public static function changeGroupTest($group_test_id)
    {
        $test = static::findOne($group_test_id);
        $students = StudentTest::find()->where(['group_test_id' => $group_test_id]);
        $student_count = $students->count();
        $all_points = 0;
        $students_column = StudentTest::find()
                                    ->where(['group_test_id' => $group_test_id])
                                    ->all();
        foreach($students_column as $student){
            $all_points += $student->points;
        }
        $test->avg_points = $all_points/$student_count;
        $current_student = StudentTest::findOne(['group_test_id' => $group_test_id, 'user_id' => Yii::$app->user->identity->id]);
        $mark = $current_student->mark;
        if($mark == 5){
            $test->val_5++;
        }elseif($mark == 4){
            $test->val_4++;
        }elseif($mark == 3){
            $test->val_3++;
        }elseif($mark == 2){
            $test->fails++;
        }
        return $test->save();
---
SELECT * FROM `group_test` WHERE `id`='35'
SELECT COUNT(*) FROM `student_test` WHERE `group_test_id`='35'
SELECT * FROM `student_test` WHERE `group_test_id`='35'
SELECT EXISTS(SELECT * FROM `test` WHERE `test`.`id`=178)
SELECT * FROM `student_test` WHERE (`group_test_id`='35') AND (`user_id`=81)
UPDATE `group_test` SET `avg_points`=18.4, `val_3`=2 WHERE `id`=35

    public static function getTestDates($group_test_id)
    {
        $student_tests = StudentTest::find()
                            ->select('date')
                            ->where(['group_test_id' => $group_test_id])
                            ->asArray()
                            ->all();
---
SELECT `date` FROM `student_test` WHERE `group_test_id`='36'

    public static function getTestUnpass($group_id, $group_test_id)
    {
        $first_group = Group::getPreviousGroups($group_id);
        $students = UserGroup::getCurrentStudents($first_group);
        $test = static::findOne($group_test_id);
        $ids = [];
        foreach($students as $id => $student){
            $student_test = StudentTest::findOne(['user_id' => $id, 'group_test_id' => $group_test_id]);
---
SELECT * FROM `group_test` WHERE `id`=36
SELECT * FROM `student_test` WHERE (`user_id`=111) AND (`group_test_id`=36)

    public static function getLatestTestMarks( $student_test_ids)
    {
        $marks = [];
        $marks[5] = 0;
        $marks[4] = 0;
        $marks[3] = 0;
        $marks[2] = 0;
        foreach($student_test_ids as $student_test_id)
        {
            $student_mark = StudentTest::findOne($student_test_id) -> mark;
---
SELECT * FROM `student_test` WHERE `id`=53

    public static function getTestStatistic($group_id)
    {
        return static::find()->where(['group_id' => $group_id])->asArray()->all();
---
SELECT * FROM `group_test` WHERE `group_id`=1