models/Level.php

    public static function getLevels()
    {
        return static::find()->select('title')->indexBy('id')->column();
---
SELECT `title`, `level`.`id` FROM `level`

    public static function getLevelId($title)
    {
        return static::findOne(['title' => $title])->id;
---
SELECT * FROM `level` WHERE `title`='Лёгкий'