models/StudentTest.php

    public static function createStudentTest($test_id, $group_test_id, $attempt, $user_id)
    {
        $modelStudentTest = new StudentTest();
        $modelStudentTest -> points = static::getStudentTestPoints($test_id, $group_test_id, $attempt, $user_id );
        $modelStudentTest -> mark = static::getStudentTestMark($test_id, $group_test_id, $attempt, $user_id);
        $modelStudentTest -> test_id = $test_id;
        $modelStudentTest -> user_id = Yii::$app->user->identity->id;
        $modelStudentTest -> group_test_id = $group_test_id;
        $modelStudentTest -> cheked = 0;
        $modelStudentTest -> attempt = $attempt;
        $modelStudentTest -> date = date('Y-m-d');

        $test_questions = Test::getTestQuestionsList($group_test_id);

        if($modelStudentTest -> save()){
            $deny = Deny::find()->where(['user_id' => Yii::$app->user->identity->id, 'group_test_id' => $group_test_id])->one();
            $deny -> true_false = 0;
            $res = $deny->save();
---
SELECT EXISTS(SELECT * FROM `user` WHERE `user`.`id`=81)
SELECT * FROM `deny` WHERE (`user_id`=81) AND (`group_test_id`='35')
UPDATE `deny` SET `true_false`=0 WHERE `id`=27

    public static function getIsChecked($student_id, $group_test_id, $attempt)
    {
        $current_student_test = static::findOne(['user_id' => $student_id, 'group_test_id' => $group_test_id, 'attempt' => $attempt]);
        $test_id = GroupTest::findOne($group_test_id)->test_id;
        $questions = Question::find()->where(['test_id' => $test_id])->all();
        $counter = 0;
        foreach($questions as $question){
            $student_answer = StudentAnswer::findOne(['question_id' => $question['id'], 'user_id' => $student_id, 'attempt' => $attempt]);
            if($student_answer){
                if($student_answer->cheked === 0){
                    $counter++;
                }
            }

        }
        if($counter != 0){
            $current_student_test->cheked = 0;
        }else{
            $current_student_test->cheked = 1;
        }
        if($current_student_test->save()){
---
SELECT EXISTS(SELECT * FROM `test` WHERE `test`.`id`=178)
SELECT * FROM `student_test` WHERE (`user_id`=81) AND (`group_test_id`='35') AND (`attempt`=3)
SELECT EXISTS(SELECT * FROM `group_test` WHERE `group_test`.`id`=35)
SELECT * FROM `group_test` WHERE `id`='35'
SELECT * FROM `question` WHERE `test_id`=178
SELECT * FROM `student_answer` WHERE (`question_id`=326) AND (`user_id`=81) AND (`attempt`=3)
UPDATE `student_test` SET `cheked`=1 WHERE `id`=66

    public static function getStudentTestPoints($test_id, $group_test_id, $attempt, $user_id)
    {
        // $user = User::findOne(Yii::$app->user->identity->id);
        $test = Test::findOne($test_id);
        $points = 0;
        $questions = Question::find() -> where(['test_id' => $test_id]) -> all();
        $answers = [];
        foreach($questions as $question){
            $student_answers = StudentAnswer::find()
                                    -> where(['user_id' => $user_id, 'attempt' => $attempt, 'question_id' => $question['id']])
                                    -> all();
            $i = 0;
            foreach($student_answers  as $answer ){
                $answers[$answer['question_id']][$i] = $answer['answer_id'];
                $i++;
            }
        }
        foreach($answers as $question_id => $answer){
            if(Question::findOne($question_id)->type_id == Type::getTypeId('Ввод ответа от студента')){
                $student_answer = StudentAnswer::findOne(['question_id' => $question_id, 'user_id' => $user_id, 'attempt' => $attempt]);
                $res = $student_answer -> true_false;
            }else{
                $res = StudentAnswer::getIsCorrectAnswer($question_id, $answer);
            }
            if($res){
                $question_level_id = Question::findOne($question_id)->level_id;
---
SELECT EXISTS(SELECT * FROM `test` WHERE `test`.`id`=178)
SELECT * FROM `test` WHERE `id`=178
SELECT * FROM `question` WHERE `test_id`=178
SELECT * FROM `student_answer` WHERE (`user_id`=81) AND (`attempt`=3) AND (`question_id`=326)
SELECT * FROM `question` WHERE `id`=326
SELECT * FROM `student_answer` WHERE (`question_id`=329) AND (`user_id`=81) AND (`attempt`=3)
SELECT * FROM `question` WHERE `id`=327

    public static function getStudentTestMark($test_id, $group_test_id, $attempt, $user_id)
    {
        $student_points = static::getStudentTestPoints($test_id, $group_test_id, $attempt, $user_id);
        $max_points = Test::findOne($test_id) -> max_points;
---
SELECT * FROM `test` WHERE `id`=178

    public static function changeStudentTest($test_id, $group_test_id, $attempt, $student_id)
    {
        $student_test = StudentTest::findOne(['group_test_id' => $group_test_id, 'attempt' => $attempt, 'user_id' => $student_id]);
---
SELECT EXISTS(SELECT * FROM `test` WHERE `test`.`id`=178)
SELECT * FROM `student_test` WHERE (`group_test_id`=35) AND (`attempt`='3') AND (`user_id`='81')

    public static function getTestsCount($user_id)
    {
        $res = static::find()->where(['user_id' => $user_id])->select('group_test_id')->column();
---
SELECT `group_test_id` FROM `student_test` WHERE `user_id`=81

    public static function getPassedTests($user_id)
    {
        $res = static::find()
                        ->where(['user_id' => $user_id])
                        ->indexBy('group_test_id')
                        ->column();
---
SELECT * FROM `student_test` WHERE `user_id`=81

    public static function getUncheckedTests()
    {
        return static::find()->where(['cheked' => 0])->asArray()->all();
---
SELECT * FROM `student_test` WHERE `cheked`=0