models/StudentAnswer.php

SELECT * FROM `answer` WHERE (`true_false`=1) AND (`question_id`=342)
---
    public static function getIsCorrectAnswer($question_id, $user_answers_id)
    {

        if(!is_array($user_answers_id)){
            $answer = $user_answers_id;
            $user_answers_id = [];
            $user_answers_id[0] = $answer;
        }else{

            if(count($user_answers_id) == 1){
                foreach($user_answers_id as $val){
                    if(is_array($val)){
                        $user_answers_id = $val;
                    }
                }
            }
        }

        // sVarDumper::dump($user_answers_id, 10, true);die;

        if($question_id){
            $correct_answers = Question::findOne($question_id)->getAnswers()->where(['true_false' => 1])->column();

SELECT EXISTS(SELECT * FROM `answer` WHERE `answer`.`id`=657)
SELECT * FROM `student_answer` WHERE (`answer_id`='657') AND (`user_id`='81') AND (`attempt`='3')
UPDATE `student_answer` SET `cheked`=1, `true_false`=1 WHERE `id`=333
---
    public static function changeAnswer($answer_id, $student_id, $value, $attempt)
    {
        $studetn_answer = static::findOne(['answer_id' => $answer_id, 'user_id' => $student_id, 'attempt' => $attempt]);
        $studetn_answer->cheked = 1;
        $studetn_answer->true_false = $value;
        return $studetn_answer->save();

SELECT * FROM `student_test` WHERE (`group_test_id`='35') AND (`user_id`=81)
---
    public static function getLastAttempt($group_test_id)
    {
        $student_tests = StudentTest::find()->where(['group_test_id' => $group_test_id, 'user_id' => Yii::$app->user->identity->id])->all();