models/Test.php

    public static function getTestsList()
    {
        return static::find() -> select('title') -> indexBy('id')->column();
---
SELECT `title`, `test`.`id` FROM `test`

    public static function getTestQuestionsList($group_test_id)
    {
        $questions_list = [];
        $group_test = GroupTest::findOne($group_test_id)->test_id;
        $question = Test::findOne($group_test) -> questions_count;
---
SELECT * FROM `group_test` WHERE `id`='35'
SELECT * FROM `test` WHERE `id`=178

    public static function getQuestionsByLevel($test_id, $level_title)
    {
        return static::findOne($test_id)->getQuestions()->where(['level_id' => Level::getLevelId($level_title)])->column();
---
SELECT * FROM `question` WHERE (`level_id`=4) AND (`test_id`=178)

    public static function getNextQuestion($passed_questions, $test_id)
    {
        if($passed_questions){
            if(Question::findOne(array_key_last($passed_questions))->type_id == Type::getTypeId('Ввод ответа от студента')){
                $answer = true;
            }else{
                $answer = StudentAnswer::getIsCorrectAnswer(array_key_last($passed_questions), end($passed_questions));
            }
        }

        $question_count = Test::findOne($test_id) -> questions_count;

        if(count($passed_questions) == $question_count){
            return false;
        }

        if($passed_questions){
            $current_question_level_id = Question::findOne(array_key_last($passed_questions))->level_id;
            $previous_question_id = array_keys(array_slice($passed_questions, -2, 1, true));
            $previous_question_level_id = Question::findOne($previous_question_id)->level_id;
---
SELECT * FROM `question` WHERE `id`=342
SELECT * FROM `test` WHERE `id`=178
SELECT * FROM `question` WHERE `id`=339

        }else{
            if($answer){
                if($previous_question_level_id != $current_question_level_id){
                    $title = Level::findOne($current_question_level_id)->title;
---
SELECT * FROM `level` WHERE `id`=5