models/Type.php

    public static function getTypes()
    {
        return static::find()->select('title')->indexBy('id')->column();
---
SELECT `title`, `type`.`id` FROM `type`

    public static function getTypeId($title)
    {
        return static::findOne(['title' => $title]) -> id;
---
SELECT * FROM `type` WHERE `title`='Ввод ответа от студента'