models/UserGroup.php

SELECT * FROM `user_group` WHERE `user_id`=81
---
    public static function getGroupTitleByUser($user_id)
    {
        $group_id = static::findOne(['user_id' => $user_id]) -> group_id;

SELECT * FROM `group` WHERE `id`='1'
SELECT `user_group`.`user_id` FROM `user_group` INNER JOIN `auth_assignment` `auth_as` ON auth_as.user_id = user_group.user_id WHERE (`group_id`=11) AND (`auth_as`.`item_name`='student')
SELECT * FROM `user` WHERE `id`=81
---
    public static function getUsersOfGroup($group_id, $current_group_id)
    {
        $group_first_year = Group::findOne($current_group_id) -> year + 0;
        $group_second_year = Group::findOne($current_group_id) -> year + 1;
        $group_months = [];
        for($i = 9; $i <= 12; $i++){
            $group_months[$i] = $group_first_year;
        }
        for($i = 1; $i <= 6; $i++){
            $group_months[$i] = $group_second_year;
        }
        $user_ids = static::find()
                        ->innerJoin(['auth_as'=>'auth_assignment'], 'auth_as.user_id = user_group.user_id')
                        ->select(['user_group.user_id'])
                        ->where(['group_id' => $group_id,'auth_as.item_name' => 'student'])
                        ->asArray()
                        ->all();
        $ids = [];
        foreach($user_ids as $user_id){
            $user = User::findOne(['id' => $user_id['user_id']]);

SELECT * FROM `group` WHERE `id`='1'
---
                }
            }

            if(Group::findOne($current_group_id) -> year.'-09-01' < $user->graduated){

SELECT `user_group`.`user_id` FROM `user_group` INNER JOIN `auth_assignment` `auth_as` ON auth_as.user_id = user_group.user_id WHERE (`group_id`=11) AND (`auth_as`.`item_name`='student')
SELECT * FROM `user` WHERE `id`=81
---
    public static function getCurrentStudents($group_id)
    {
        $user_ids = static::find()
                        ->innerJoin(['auth_as'=>'auth_assignment'], 'auth_as.user_id = user_group.user_id')
                        ->select(['user_group.user_id'])
                        ->where(['group_id' => $group_id,'auth_as.item_name' => 'student'])
                        ->asArray()
                        ->all();
        $ids = [];
        foreach($user_ids as $user_id)
        {
            $user = User::findOne(['id' => $user_id['user_id']]);

SELECT * FROM `user_group` WHERE `user_id`=77
---
    public static function getTeachersGroups($teacher_id)
    {
        return static::find()->where(['user_id' => $teacher_id])->asArray()->all();