models/User.php

SELECT * FROM `user` WHERE `login`='1'
---
    public static function findByUsername($login)
    {
        return static::findOne(['login' => $login]);

SELECT * FROM `user` WHERE `id`=81
---
    public static function getFIO($id)
    {
        $surname = static::findOne(['id' => $id]) -> surname;
        $name = static::findOne(['id' => $id]) -> name;
        $patronymic = static::findOne(['id' => $id]) -> patronymic;

SELECT * FROM `user_group` WHERE `user_id`=81
---
    public function getGroupId()
    {
        return $this->userGroup->group_id;